---
title: JoinElementsFailures
classe: Autodesk.Revit.DB.BuiltInFailures+JoinElementsFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 24
---

# JoinElementsFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CannotCope { get; }` | `JoinElementsFailures.CannotCope` | FailureDefinitionId |
| `FailureDefinitionId CannotCutJoinedGeometry { get; }` | `JoinElementsFailures.CannotCutJoinedGeometry` | FailureDefinitionId |
| `FailureDefinitionId CannotJoinDesignOptions { get; }` | `JoinElementsFailures.CannotJoinDesignOptions` | FailureDefinitionId |
| `FailureDefinitionId CannotJoinElements { get; }` | `JoinElementsFailures.CannotJoinElements` | FailureDefinitionId |
| `FailureDefinitionId CannotJoinElementsError { get; }` | `JoinElementsFailures.CannotJoinElementsError` | FailureDefinitionId |
| `FailureDefinitionId CannotJoinElementsMultiPlaneError { get; }` | `JoinElementsFailures.CannotJoinElementsMultiPlaneError` | FailureDefinitionId |
| `FailureDefinitionId CannotJoinElementsStructural { get; }` | `JoinElementsFailures.CannotJoinElementsStructural` | FailureDefinitionId |
| `FailureDefinitionId CannotJoinElementsStructuralError { get; }` | `JoinElementsFailures.CannotJoinElementsStructuralError` | FailureDefinitionId |
| `FailureDefinitionId CannotJoinElementsWarn { get; }` | `JoinElementsFailures.CannotJoinElementsWarn` | FailureDefinitionId |
| `FailureDefinitionId CannotJoinRoof { get; }` | `JoinElementsFailures.CannotJoinRoof` | FailureDefinitionId |
| `FailureDefinitionId CannotJoinRoofError { get; }` | `JoinElementsFailures.CannotJoinRoofError` | FailureDefinitionId |
| `FailureDefinitionId CannotKeepJoined { get; }` | `JoinElementsFailures.CannotKeepJoined` | FailureDefinitionId |
| `FailureDefinitionId CannotKeepReferenceOfJoinedElement { get; }` | `JoinElementsFailures.CannotKeepReferenceOfJoinedElement` | FailureDefinitionId |
| `FailureDefinitionId CannotKeepReferenceOfJoinedElementWarning { get; }` | `JoinElementsFailures.CannotKeepReferenceOfJoinedElementWarning` | FailureDefinitionId |
| `FailureDefinitionId CannotKeepTrussJoined { get; }` | `JoinElementsFailures.CannotKeepTrussJoined` | FailureDefinitionId |
| `FailureDefinitionId CannotKeepWallJoinToRoof { get; }` | `JoinElementsFailures.CannotKeepWallJoinToRoof` | FailureDefinitionId |
| `FailureDefinitionId CannotKeepWallJoinToRoofError { get; }` | `JoinElementsFailures.CannotKeepWallJoinToRoofError` | FailureDefinitionId |
| `FailureDefinitionId ElementWillBeDetachedFromPlane { get; }` | `JoinElementsFailures.ElementWillBeDetachedFromPlane` | FailureDefinitionId |
| `FailureDefinitionId FootingWillMoveToBottom { get; }` | `JoinElementsFailures.FootingWillMoveToBottom` | FailureDefinitionId |
| `FailureDefinitionId JoiningDisjoint { get; }` | `JoinElementsFailures.JoiningDisjoint` | FailureDefinitionId |
| `FailureDefinitionId JoiningDisjointWarn { get; }` | `JoinElementsFailures.JoiningDisjointWarn` | FailureDefinitionId |
| `FailureDefinitionId StairsComponentTypeUnsupportedError { get; }` | `JoinElementsFailures.StairsComponentTypeUnsupportedError` | FailureDefinitionId |
| `FailureDefinitionId StructGroupMemberWillDetachFromGrid { get; }` | `JoinElementsFailures.StructGroupMemberWillDetachFromGrid` | FailureDefinitionId |
| `FailureDefinitionId WallTypeUnsupportedError { get; }` | `JoinElementsFailures.WallTypeUnsupportedError` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```